package com.xinyan.spider.isp.base;

import com.xinyan.spider.isp.common.Constants;

/**
 * 返回状态码
 * @description 
 * @author heliang
 * @date 2016年8月8日 下午5:00:32
 * @version v1.0
 */
public enum StatusCode {

    请输入图片验证码("10001","请输入图片验证码"),
    请输入短信验证码("10002","请输入短信验证码"),

    图片验证码错误 ("10003","图片验证码错误"),
    输入有误 ("10004","输入有误"),
    登陆验证超过 ("10005","登陆验证超过["+ Constants.MAX_RETRY_TIIMES +"]次"),
    用户名或密码错误 ("10006","用户名或密码错误"),
    验证短信验证码错误 ("10007","验证短信验证码错误"),
    验证短信验证码异常 ("10008","验证短信验证码异常"),
    联通登入超时 ("10009","联通登入超时"),
    系统忙 ("10010","系统忙，请稍后再试"),
    不支持初始密码登录 ("10011","不支持初始密码登录"),
    不支持简单密码登录 ("10012","不支持简单密码登录"),
    登录密码出错已达上限 ("10013","登录密码出错已达上限,请修改密码后登录，或等3小时候再登录"),
    解析基础信息出错 ("10014","解析基础信息出错"),
    解析积分余额信息出错 ("10015","解析积分余额信息出错"),
    登陆出错 ("10016","登陆出错"),
    解析通话详情出错 ("10017","解析通话详情出错"),
    解析账单信息出错 ("10018","解析账单信息出错"),
    解析办理业务信息出错 ("10019","解析办理业务信息出错"),
    解析短信记录出错 ("10020","解析短信记录出错"),
    解析上网记录出错 ("10021","解析上网记录出错"),
    解析充值记录出错 ("10022","解析充值记录出错"),
    网站加载超时 ("10023","网站加载超时"),
    解析入网时间出错 ("10024","解析入网时间出错"),
    解析用户等级出错 ("10025","解析用户等级出错"),
    已经发送短信验证码 ("10026","已经发送短信验证码"),
    获取短信验证码失败 ("10027","获取短信验证码失败"),
    发送短信验证码失败 ("10028","发送短信验证码失败"),
    接收短信验证码超时 ("10029","接收短信验证码超时"),
    接收用户输入超时 ("10030","接收图片验证码超时"),
    短信验证码正确 ("10031","短信验证码正确"),
    短信验证码错误 ("10032","短信验证码错误"),
    登陆失败 ("10033","登陆失败"),
    系统不再下发 ("10034","系统不再下发,请明天再试"),
    请注册后使用 ("10035","请注册后使用"),
    获取图片验证码错误 ("10036","获取图片验证码错误"),
    获取SAMLRequest值失败 ("10037","获取SAMLRequest值失败"),
    获取SAMLart值失败 ("10038","获取SAMLart值失败"),
    服务密码错误 ("10039","服务密码错误"),
    已有账号登录是否使用新账号 ("10040","已有账号登录,是否使用新账号"),
    发送图片验证码错误 ("10041","发送图片验证码错误"),
    用户名密码不能为空("10042","用户名密码不能为空"),
    账号被("10043","账号或密码频繁出错"),
    网络超时("10044","网络超时"),
    操作失败("10045","操作失败,请稍后重试"),

    //---广东移动---//
    请输入正确的广东移动手机号码 ("10046","请输入正确的广东移动手机号码"),
    短信验证码发送频繁 ("10047","短信验证码发送频繁"),
    IP限制访问 ("10048",""),
    二次鉴权失败 ("10049","二次鉴权失败"),
    短信验证码发送次数超过上限 ("10050","短信验证码发送次数超过上限"),
    数据解析中发生错误 ("10051","数据解析中发生错误"),
    当天查询详单已达6次 ("10052","当天查询详单已达6次不可再查询详单，请明天再来查询"),

    用户密码过于简单 ("10053","用户密码过于简单"),
    二次登陆失败 ("10054","二次登陆失败"),
    用户不存在 ("10055","用户不存在"),
    登录手机不匹配 ("10056","登录手机不匹配"),
    登陆失败稍后再试 ("10057","登陆失败,请稍后再试"),
    获取真实姓名出错 ("10058","获取真实姓名出错"),
    山东电信网站异常 ("10059","山东电信网站异常，登录失败，请稍候再试"),
    使用人数较多 ("10060","抱歉，使用人数较多，请稍后再试"),
    获取产品类型失败 ("10061","获取产品类型失败"),
    短信验证超时 ("10062","短信验证超时"),
    验证码错误或过期 ("10063","验证码错误或过期"),
    没有权限查询该号码的详单信息 ("10064","没有权限查询该号码的详单信息"),
    身份证信息输入有误 ("10065","身份证信息输入有误"),
    短信发送频繁 ("10066","24小时内发送5次信息"),
    实名认证失败 ("10067","实名认证失败，请检查身份证信息"),
    系统操作失败 ("10068","系统操作失败"),
    登陆异常 ("10069","登陆异常"),
    您的账户被锁定24小时候后可重新登录 ("10070","对不起，您的账户被锁定，24小时候后可重新登录，如有问题请咨询客服。"),

    //---浙江移动---//
    用户名或密码格式错误 ("10071","用户名或密码格式错误"),
    帐号被锁定 ("10072","您的密码已经错误次数过多，用户被锁定"),
    营业厅提示要求重置服务密码后登陆 ("10073","营业厅提示要求重置服务密码后登陆"),

    //---重庆移动---//
    密码加密验证失败 ("10074","密码加密验证失败"),
    获取uid失败 ("10075","获取uid失败"),
    短信验证码已失效 ("10076","短信验证码已失效"),

    //---河南移动---//
    官网正在维护 ("10077","官网正在维护，请稍后访问"),
    不能重复登录 ("10078","尊敬的客户，您已成功登录，不能重复登录"),
    外省号码不能登录河南移动 ("10079","很抱歉，外省号码不能登录河南移动"),
    非移动号码不能登录河南移动 ("10080","很抱歉，非移动号码不能登录河南移动"),
    您的密码过于简单 ("10081","尊敬的客户：您好！您的密码过于简单，为更好的保护您的个人信息，请发送“XGMM（空格）原密码（空格）新密码”至10086修改密码"),
    不要频繁获取 ("10082","您在24小时内验证二次鉴权码失败次数已达到20次,不要频繁获取"),
    次数已达到10次("10083","您在24小时内获取二次鉴权码次数已达到10次,不要频繁获取"),
    只能获取一次验证码 ("10084","30秒内只能获取一次验证码，不要频繁获取"),
    二次鉴权码次数已达到10次 ("10085","您在24小时内获取二次鉴权码次数已达到10次,不要频繁获取"),

    //---福建移动---//
    请明天再试 ("10086","尊敬的用户，您好！您今天已输入错误密码5次,请明天再试"),
    短信验证码数量已达上限 ("10087","尊敬的用户，您今天申请下发的短信验证码数量已达上限，60分钟内最多5条，24小时内最多20条"),
    发送图片验证码失败("10088","发送图片验证码失败"),

    //---贵州移动---//
    您不是贵州移动用户 ("10089","您不是贵州移动用户"),
    登陆频率过高 ("10090","登陆频率过高"),

    //---湖北移动---//
    获取SAMLart失败 ("10091","获取SAMLart，RelayState，PasswordType值失败"),
    人工为您处理反馈 ("10092","尊敬的用户，如果您尝试多次仍然无法成功，或者遇到其他问题，请填写提交下面表单，我们将人工为您处理反馈"),

    //---吉林移动---//
    请检查号码是否属于吉林移动 ("10093","请检查号码是否属于吉林移动"),
    请您耐心等待 ("10094","请您耐心等待，30秒钟之后再试"),

    //---上海移动---//
    请核对后重新输入 ("10095","无法为您所输入的手机号码发送动态密码，请核对后重新输入"),

    //---北京移动---//
    客服密码不正确 ("10096","客服密码不正确"),

    //---全国移动---//
    验证手机号码失败 ("10097","验证手机号码失败"),
    账号锁定 ("10098","账号锁定"),
    密码锁定 ("10099","密码锁定"),
    采集基本信息出错 ("10100","采集基本信息出错"),
    采集通话详情出错 ("10101","采集通话详情出错"),
    采集短信记录出错 ("10102","采集短信记录出错"),
    采集上网记录出错 ("10103","采集上网记录出错"),
    采集账单记录出错 ("10104","采集账单记录出错"),
    采集办理业务信息出错 ("10105","采集办理业务信息出错"),
    采集信息出错 ("10106","采集信息出错"),
    采集套餐信息出错 ("10107","采集套餐信息出错"),
    采集充值记录出错 ("10108","采集充值记录出错"),
    //山西移动
    密码错误次数过多 ("10109","密码错误次数过多"),
    
    请使用山西号码登录 ("10110","尊敬的用户，请使用山西移动号码登录"),
    请使用北京号码登录 ("10111","手机号码非北京号码,请切换至号码归属地"),

    SUCCESS ("0000","操作成功"),
    登陆成功("0000","登陆成功"),
    爬取中("0001","爬取中"),
    爬取成功("0000","爬取成功"),
    解析成功("0000","解析成功"),
    FAILURE ("9999","操作失败"),
    官网系统繁忙("10112","官网系统繁忙，稍后再试"),

    ;
    //状态码
    private String code;
    //状态描述
    private String msg;

    private StatusCode(String code,String msg){
        this.code=code;
        this.msg=msg;
    }

    public static String getMsg(String code){
        String msg="";
        for (StatusCode type : StatusCode.values()) {
            if(type.getCode().equals(code)){
                msg= type.getMsg();
                break;
            }
        }
        return msg;
    }

    public static StatusCode parse(String code){
        StatusCode statusCode=null;
        for (StatusCode type : StatusCode.values()) {
            if(type.getCode().equals(code)){
                statusCode= type;
                break;
            }
        }
        return statusCode;
    }

    public String getCode() {
        return code;
    }

    public void setCode(String code) {
        this.code = code;
    }

    public String getMsg() {
        return msg;
    }

    public void setMsg(String msg) {
        this.msg = msg;
    }
}
